export type aboutDataProps = {
  subTitle: string;
  description: string;
};

export const visionData: aboutDataProps[] = [
  {
    subTitle: "共創して楽しいを生み出す",
    description:
      "私たちのプログラミングサークルは、楽しむことを軸に技術と向き合います。エンジニアリングのスキルを磨くだけでなく、ITの力を活用して世の中を豊かにし、身近な人々に喜びや幸せを届けることを目指します。同じ目標を持った仲間と繋がりながらも、それぞれの個性と強みを活かしながら、一人では成し得ないことを仲間と共に実現し、プログラミングを通じて楽しく成長する場を実現させたいです。",
  },
];

export const missionData: aboutDataProps[] = [
  {
    subTitle: "学び与え合う循環の創造",
    description:
      "桜梅桃李の精神をもとに、メンバー全員がそれぞれの個性と強みを生かしボトムアップに活動できる環境を目指しています。技術の習得だけでなく、仲間と共に切磋琢磨し合い、最初は教えられる立場のメンバーがやがて教える立場となり、知識と経験を次の世代に伝えることで、成蹊大学から継続的な成長と発展、成果を出します。PeachTechは互いに高め合い、技術のみならずパーソナリティをも向上させるコミュニティを築き上げます。",
  },
];

export const valueData: aboutDataProps[] = [
  {
    subTitle: "7人8脚の精神",
    description:
      "一人で淡々とプログラミングをするだけではこのコミュニティへの参加を活かしきれていません。PeachTechでは、コミュニティ内で皆が一体となって課題解決や社会問題に向き合うことにこそ価値があります。メンバーは互いにサポートし合いながら、学生のうちから多様な経験と知識を得ることで未来に向け自信とスキルを身につけます",
  },
  {
    subTitle: "個性と強みを活かす",
    description:
      "エンジニアにとって、コードを書くことやプログラミングができることが全てではありません。技術的に優れる者、ユーザー目線で最良の機能を考える者、プレゼンテーションで伝える力を持つ者、チームをマネジメントする力を持つ者、行動力がある者、それぞれが異なる強みを持っています。これらの個性と強みが集結することで、私たちは大きな目標を成し遂げるため日々挑戦しています。",
  },
];
