export type achievementDataProps = {
  src: string;
  date: string;
  title: string;
  content: string;
};

export const achievementContentData: achievementDataProps[] = [
  {
    src: "achieve12.png",
    date: "2025.4.26",
    title: "新入生welcome会を開催しました！",
    content:
      "PeachTechの新入生welcome会を開催しました！PeachTechメンバーが開発したプロダクト紹介などを行い、実際に制作物にも触れてもらいました！また懇親会を通して先輩や同期との親睦も深められました！これからも新入生と共に切磋琢磨していきます！",
  },
  {
    src: "achieve11.png",
    date: "2025.4.15",
    title: "PeachTechが技育プロジェクトの公式パートナーになりました！",
    content:
      "PeachTechが技育プロジェクトの公式パートナーになりました！今後もさらなる成長を目指し、活動していきます！",
  },
  {
    src: "achieve10.png",
    date: "2025.3.19",
    title: "4年生の送別会を行いました！",
    content:
      "卒業式に4年生の送別会を行いました！PeachTechロゴ入りのタンブラーをプレゼントし、元代表にはweb色紙を送りました！4年生の方々、今まで本当にお世話になりました！皆様の更なるご活躍を期待しています！！",
  },
  {
    src: "achieve9.png",
    date: "2025.2.26",
    title: "ピチフェスを開催しました！",
    content:
      "PeachTechでサークル内イベントとしてピチフェスを開催しました！様々な分野のプログラミングに触れることができ、楽しく学ぶことができました！「思っていたより難しくなかった」との声も多く、作りたいものを自分の手で作れる楽しさを改めて感じられたと思います！",
  },
  {
    src: "achieve8.png",
    date: "2025.1.10",
    title: "26卒のメンバーでご飯会を行いました！",
    content:
      "PeachTechの26卒のメンバーでご飯会を行いました！普段はあまり話さないメンバーとも話すことができ、親睦が深めることができました！同期のご飯会というのは初めての開催でしたが、今後も定期的に開催したいと思います！",
  },
  {
    src: "achieve7.png",
    date: "2024.12.10",
    title: "PACKERさんとコラボLTイベントを実施しました！",
    content:
      "12月にPACKERさん(開志専門職大学プログラミングサークル)とのコラボLTイベントを実施しました！サークルとしては初めての他大学交流のイベントで、技術に関するLTとフリーのLTをそれぞれ行いました！学びと笑いで盛り上がり、終始楽しい雰囲気のイベントでした！今後も外部とのイベントを開催していきたいと思います！",
  },
  {
    src: "achieve6.png",
    date: "2024.11.23",
    title: "欅祭に参加して展示を行いました！",
    content:
      "成蹊大学の学園祭である欅祭にて、PeachTechは制作物の展示を行いました！サークルのメンバーが個人で開発したものやチームで開発したものなど、20個ほどの製作物を展示することができました！たくさんの方に来場していただき、実際にアプリやゲームを体験して楽しんでもらえて、とても嬉しかったです！",
  },
  {
    src: "achieve5.png",
    date: "2024.09.11",
    title: "PeachTech初の夏合宿を開催しました！",
    content:
      "PeachTechで4チームに分かれ、ハッカソン形式の合宿しました！フロントエンド、サーバーサイド、ハードウェア等、それぞれに特化した開発が行われました！初心者から経験者までが参加し、それぞれとてもいい経験になりました！",
  },
  {
    src: "achieve4.png",
    date: "2024.5.14",
    title: "60人以上のメンバーが新しい仲間になりました！",
    content:
      "PeachTechは2024年の新歓活動において、1年生に限らず、2.3.4年生も含め、多くのメンバーがPeachTechの仲間になりました！運営一同とても嬉しく思います！これからもPeachTechを何卒よろしくお願いいたします！",
  },
  {
    src: "achieve3.png",
    date: "2024.03.20",
    title: "PeachTechの創設者を見送りました！",
    content:
      "PeachTechを創設した元代表が成蹊大学を卒業しました！卒業おめでとうございます！メンバーそれぞれとてもお世話になりました！今後のご活躍も心から祈っています！",
  },
  {
    src: "achieve2.png",
    date: "2023.12.18",
    title: "欅祭受賞おめでとう今年一年お疲れ様でした会を開催しました！",
    content:
      "欅祭でダブル受賞したことやPeachTechのFounderへの感謝も込めて、メンバーでわいわい楽しいイベントを開催しました！PeachTechのクイズや今年一年の振り返り等、みんなで有意義な時間を過ごしました！",
  },
  {
    src: "achieve1.png",
    date: "2023.12.12",
    title: "PeachTechが個人・団体両方で成蹊大学賞をいただきました！",
    content:
      "PeachTechとしては、正式に活動を始めまだ1年目というのもあり、とても嬉しいです。これからも、より多くの方にPeachTechを知っていただけるように頑張ります！",
  },
];
