export const isPeachTechText = [
  {
    number: "01",
    title: "成蹊大学唯一の\nプログラミングサークル",
    description:
      "PeachTechは2022年に発足した成蹊大学初のプログラミングサークルです。初心者から経験者まで100人以上のプログラミングに興味のある学生が参加しています。プログラミングスキルの向上を目指し、日々個人開発やチーム開発、イベントの開催等を行っています。また、学生の中には外部のイベントで受賞したり、実務での経験を積んだりしている人もいます。",
    src: "Programming-amico.svg",
  },
  {
    number: "02",
    title: "ゼロからプログラミング支援",
    description:
      "PeachTechではプログラミング初心者でも技術力をつけられるような体制が整っています。サークル独自のチュートリアルや先輩たちに質問ができるほか、有料教材を無料で使えるなどゼロからでもプロのエンジニアを目指せる環境が整っています。実際に大学からプログラミングを始めて、エンジニアとして活躍している人もいます。現在ではメンターとしてPeachTechに関わっています。",
    src: "Application programming interface-rafiki.svg",
  },
];
